Revit 2027 API
BuiltInFailures.WallFailures.ChangingWallsweepType Property
 This wall sweep instance has different profile or material than its type. You may delete the sweep, or if you ignore this warning, it will be regenerated according to its type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ChangingWallsweepType { get; }
Public Shared ReadOnly Property ChangingWallsweepType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ChangingWallsweepType {
	FailureDefinitionId^ get ();
}
static member ChangingWallsweepType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace